In [2]:
import pandas as pd

## data manipulation

In [3]:
df=pd.read_csv("data.csv")

In [4]:
#data={'name':['alice','lily','bob'],'age':[20,22,24]}

In [5]:
df

    name   age
0  Alice  25.0
1    Bob  30.0
2   rita  30.0

In [6]:
df.at[0,'age']=56

In [7]:
df.head()

    name   age
0  Alice  56.0
1    Bob  30.0
2   rita  30.0

In [8]:
df.loc[0,'age']=23

In [9]:
df

    name   age
0  Alice  23.0
1    Bob  30.0
2   rita  30.0

In [10]:
df.columns

Index(['name', 'age'], dtype='object')

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [12]:
df.iloc[0,1]=34

In [13]:
df

    name   age
0  Alice  34.0
1    Bob  30.0
2   rita  30.0

In [14]:
df['height']=[165,150,175]

In [15]:
df.head()

    name   age  height
0  Alice  34.0     165
1    Bob  30.0     150
2   rita  30.0     175

In [16]:
df.height

0    165
1    150
2    175
Name: height, dtype: int64

In [17]:
df['test']=[2,3,'']

In [18]:
df

    name   age  height test
0  Alice  34.0     165    2
1    Bob  30.0     150    3
2   rita  30.0     175

In [19]:
df['test']=[1,2,3]

In [20]:
import numpy as np

In [21]:
df['test']=[2,np.nan,3]

In [22]:
df

    name   age  height  test
0  Alice  34.0     165   2.0
1    Bob  30.0     150   NaN
2   rita  30.0     175   3.0

In [23]:
df.isna()

    name    age  height   test
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False

In [24]:
df.loc[2,'name']='charlie'

In [25]:
df['gender']='male'

In [26]:
df

      name   age  height  test gender
0    Alice  34.0     165   2.0   male
1      Bob  30.0     150   NaN   male
2  charlie  30.0     175   3.0   male

In [27]:
df.loc[3]=['eve',29,178,3,'female']

In [28]:
df.drop(['test'],axis=1,inplace=True)
df.drop(['height'],axis=1,inplace=True)

In [29]:
df

      name   age  gender
0    Alice  34.0    male
1      Bob  30.0    male
2  charlie  30.0    male
3      eve  29.0  female

In [30]:
df.isna().sum()

name      0
age       0
gender    0
dtype: int64

In [31]:
df.loc[5]=["asmi",np.nan,'female']

In [32]:
df

      name   age  gender
0    Alice  34.0    male
1      Bob  30.0    male
2  charlie  30.0    male
3      eve  29.0  female
5     asmi   NaN  female

In [33]:
df['age'].fillna(26,inplace=True)
#df.age.fillna(26inplace=True)
#df.dropna  it delete row which contains nan value

In [34]:
df

      name   age  gender
0    Alice  34.0    male
1      Bob  30.0    male
2  charlie  30.0    male
3      eve  29.0  female
5     asmi  26.0  female

In [35]:
df.groupby(['gender','name']).count()

                age
gender name
female asmi       1
       eve        1
male   Alice      1
       Bob        1
       charlie    1

In [36]:
df.reset_index(inplace=True)
#df.reset_index(drop=True)

In [37]:
df

   index     name   age  gender
0      0    Alice  34.0    male
1      1      Bob  30.0    male
2      2  charlie  30.0    male
3      3      eve  29.0  female
4      5     asmi  26.0  female

In [38]:
df.drop(3,axis=0)

   index     name   age  gender
0      0    Alice  34.0    male
1      1      Bob  30.0    male
2      2  charlie  30.0    male
4      5     asmi  26.0  female

In [39]:
df.drop('index',axis=1,inplace=True)

In [40]:
df

      name   age  gender
0    Alice  34.0    male
1      Bob  30.0    male
2  charlie  30.0    male
3      eve  29.0  female
4     asmi  26.0  female

In [41]:
col_mapper={'name':'Name','age':'Age'}

In [42]:
df.rename(columns=col_mapper)

      Name   Age  gender
0    Alice  34.0    male
1      Bob  30.0    male
2  charlie  30.0    male
3      eve  29.0  female
4     asmi  26.0  female

In [43]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [44]:
def double(x):
    return x*2

In [45]:
df['age'].apply(double)
#df['age'].apply(lambda x:x*2)

0    68.0
1    60.0
2    60.0
3    58.0
4    52.0
Name: age, dtype: float64

In [52]:
grouped=df.groupby('gender')

In [53]:
grouped.agg({"age":"mean"})

              age
gender
female  27.500000
male    31.333333

In [56]:
grouped.agg({"age":"max"})

         age
gender
female  29.0
male    34.0

In [61]:
grouped.agg({"age":"sum"}).sort_values(by='age',ascending=False)

         age
gender
male    94.0
female  55.0